Tekla Open API Reference for Tekla Structures 2025
FaceEnumerator.Current Property
 Returns the current face.
 Namespace: Tekla.Structures.Solid
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Face Current { get; }
Public ReadOnly Property Current As Face
	Get
Property Value
Type: Face
See Also
Reference
FaceEnumerator Class
Tekla.Structures.Solid Namespace